[
  {
    "id": "1",
    "name": "E-Commerce Platform Redesign",
    "shortDescription": "Complete redesign of the e-commerce platform with modern UI/UX, improved performance, and mobile-first approach to increase conversion rates.",
    "fullDescription": "This comprehensive project involves a complete overhaul of our e-commerce platform. We'll implement a modern design system based on Material Design principles, optimize performance across all devices with lazy loading and code splitting, restructure the product catalog for better navigation and SEO, integrate advanced search with filters and faceted navigation, implement a streamlined checkout process to reduce cart abandonment, and add personalized product recommendations using machine learning. The primary goal is to improve user experience and increase conversion rates by at least 35% while reducing page load times by 50%.",
    "status": "active",
    "createdAt": "2024-01-15T10:00:00Z"
  },
  {
    "id": "2",
    "name": "Mobile Banking Application",
    "shortDescription": "Cross-platform mobile banking app with biometric authentication, real-time transactions, bill payments, and comprehensive financial management tools.",
    "fullDescription": "Develop a secure, native-quality cross-platform mobile banking application using React Native and TypeScript. The app will include biometric authentication (fingerprint and face recognition), real-time transaction monitoring with push notifications, bill payment functionality with automatic reminders, peer-to-peer money transfers, budget tracking and spending analytics with interactive charts, account management for multiple accounts and cards, deposit check functionality using OCR technology, branch and ATM locator with maps integration, secure messaging with customer support, and comprehensive data encryption following banking industry standards. The application must pass rigorous security audits and comply with financial regulations.",
    "status": "active",
    "createdAt": "2024-02-20T14:30:00Z"
  },
  {
    "id": "3",
    "name": "Corporate CRM System",
    "shortDescription": "Enterprise-grade CRM system with sales pipeline management, customer analytics, automated workflows, and third-party integrations for improved team productivity.",
    "fullDescription": "Build a comprehensive Customer Relationship Management system tailored for B2B sales teams. Features include a visual sales pipeline with drag-and-drop functionality, detailed customer profiles with interaction history and communication logs, automated email sequences and follow-up reminders, lead scoring based on engagement and behavior patterns, integration with major email providers (Gmail, Outlook), calendar synchronization for meeting scheduling, customizable reporting dashboards with exportable analytics, team collaboration tools with shared notes and tasks, integration with accounting software for invoice tracking, mobile app for field sales representatives, role-based access control with granular permissions, and API for custom integrations. The system should handle up to 100,000 customer records with sub-second query performance.",
    "status": "completed",
    "createdAt": "2024-03-10T12:00:00Z"
  },
  {
    "id": "4",
    "name": "Educational Learning Platform",
    "shortDescription": "Interactive online learning platform with video courses, live classes, progress tracking, certificates, and gamification elements to enhance student engagement.",
    "fullDescription": "Create a modern educational platform that supports both self-paced and instructor-led learning. Core features include video course management with chapter organization and progress tracking, live virtual classrooms with video conferencing and screen sharing, interactive quizzes with various question types and instant feedback, assignment submission and grading system with rubrics, discussion forums for student collaboration, private messaging between students and instructors, course certificates with verification codes, gamification elements including badges, points, and leaderboards, personalized learning paths based on student performance, integrated payment gateway for course purchases, comprehensive analytics dashboard for instructors to track student engagement and performance, mobile-responsive design for learning on any device, and accessibility features to support learners with disabilities. The platform should support up to 50,000 concurrent users during peak times.",
    "status": "pending",
    "createdAt": "2024-04-01T08:45:00Z"
  }
]
